In [1]:
import pandas as pd
import numpy as np

In [2]:
df=pd.DataFrame(np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())
df

          W         X         Y         Z
A  1.449500  0.115796  0.362887 -1.408816
B  2.600844  0.014145  0.188980 -0.178104
C  0.150022  0.195958  1.151734 -1.502619
D  0.891156  0.087933 -0.269033  0.101673
E  0.908278  1.097846  1.516946 -0.915862

In [3]:
df['W']

A    1.449500
B    2.600844
C    0.150022
D    0.891156
E    0.908278
Name: W, dtype: float64

In [4]:
df['new']=df['W']+df['Y']
df

          W         X         Y         Z       new
A  1.449500  0.115796  0.362887 -1.408816  1.812388
B  2.600844  0.014145  0.188980 -0.178104  2.789824
C  0.150022  0.195958  1.151734 -1.502619  1.301756
D  0.891156  0.087933 -0.269033  0.101673  0.622123
E  0.908278  1.097846  1.516946 -0.915862  2.425224

In [5]:
df[['W','Y']]

          W         Y
A  1.449500  0.362887
B  2.600844  0.188980
C  0.150022  1.151734
D  0.891156 -0.269033
E  0.908278  1.516946

In [6]:
df

          W         X         Y         Z       new
A  1.449500  0.115796  0.362887 -1.408816  1.812388
B  2.600844  0.014145  0.188980 -0.178104  2.789824
C  0.150022  0.195958  1.151734 -1.502619  1.301756
D  0.891156  0.087933 -0.269033  0.101673  0.622123
E  0.908278  1.097846  1.516946 -0.915862  2.425224

In [7]:
df.drop('new',axis=1,inplace=True)
df

          W         X         Y         Z
A  1.449500  0.115796  0.362887 -1.408816
B  2.600844  0.014145  0.188980 -0.178104
C  0.150022  0.195958  1.151734 -1.502619
D  0.891156  0.087933 -0.269033  0.101673
E  0.908278  1.097846  1.516946 -0.915862

In [8]:
#selecting Row
df.loc[['C','E']]

          W         X         Y         Z
C  0.150022  0.195958  1.151734 -1.502619
E  0.908278  1.097846  1.516946 -0.915862

In [9]:
df.loc['C']

W    0.150022
X    0.195958
Y    1.151734
Z   -1.502619
Name: C, dtype: float64

In [10]:
df.loc['E']

W    0.908278
X    1.097846
Y    1.516946
Z   -0.915862
Name: E, dtype: float64

In [11]:
df.loc[['A','C'],['W','Y']]

          W         Y
A  1.449500  0.362887
C  0.150022  1.151734

In [12]:
df>0

      W     X      Y      Z
A  True  True   True  False
B  True  True   True  False
C  True  True   True  False
D  True  True  False   True
E  True  True   True  False

In [13]:
df['W']>0

A    True
B    True
C    True
D    True
E    True
Name: W, dtype: bool

In [14]:
df[df['W']>0]['Z']

A   -1.408816
B   -0.178104
C   -1.502619
D    0.101673
E   -0.915862
Name: Z, dtype: float64

In [15]:
newind='CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [16]:
df['states']=newind
df

          W         X         Y         Z states
A  1.449500  0.115796  0.362887 -1.408816     CA
B  2.600844  0.014145  0.188980 -0.178104     NY
C  0.150022  0.195958  1.151734 -1.502619     WY
D  0.891156  0.087933 -0.269033  0.101673     OR
E  0.908278  1.097846  1.516946 -0.915862     CO

In [17]:
df.set_index('states')

               W         X         Y         Z
states
CA      1.449500  0.115796  0.362887 -1.408816
NY      2.600844  0.014145  0.188980 -0.178104
WY      0.150022  0.195958  1.151734 -1.502619
OR      0.891156  0.087933 -0.269033  0.101673
CO      0.908278  1.097846  1.516946 -0.915862

In [18]:
df

          W         X         Y         Z states
A  1.449500  0.115796  0.362887 -1.408816     CA
B  2.600844  0.014145  0.188980 -0.178104     NY
C  0.150022  0.195958  1.151734 -1.502619     WY
D  0.891156  0.087933 -0.269033  0.101673     OR
E  0.908278  1.097846  1.516946 -0.915862     CO

In [19]:
df.reset_index()

  index         W         X         Y         Z states
0     A  1.449500  0.115796  0.362887 -1.408816     CA
1     B  2.600844  0.014145  0.188980 -0.178104     NY
2     C  0.150022  0.195958  1.151734 -1.502619     WY
3     D  0.891156  0.087933 -0.269033  0.101673     OR
4     E  0.908278  1.097846  1.516946 -0.915862     CO

In [20]:
df.set_index('states',inplace=True)

In [21]:
df

               W         X         Y         Z
states
CA      1.449500  0.115796  0.362887 -1.408816
NY      2.600844  0.014145  0.188980 -0.178104
WY      0.150022  0.195958  1.151734 -1.502619
OR      0.891156  0.087933 -0.269033  0.101673
CO      0.908278  1.097846  1.516946 -0.915862

In [23]:
df.reset_index()

  states         W         X         Y         Z
0     CA  1.449500  0.115796  0.362887 -1.408816
1     NY  2.600844  0.014145  0.188980 -0.178104
2     WY  0.150022  0.195958  1.151734 -1.502619
3     OR  0.891156  0.087933 -0.269033  0.101673
4     CO  0.908278  1.097846  1.516946 -0.915862

In [24]:
#Multi-Index

In [27]:
outside=['G1','G1','G1','G2','G2','G2']
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [28]:
inside=[1,2,3,1,2,3]
inside

[1, 2, 3, 1, 2, 3]

In [33]:
h1=list(zip(outside,inside))
h1

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [37]:
mult_ind = pd.MultiIndex.from_tuples(h1)

In [38]:
mult_ind

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [43]:
df2=pd.DataFrame(np.random.randn(6,2),index=mult_ind,columns=['col1','col2'])
df2

          col1      col2
G1 1  0.777860 -1.575967
   2  0.247734 -1.876318
   3  0.851627 -0.270488
G2 1 -0.378350 -1.949282
   2  0.409685  0.726959
   3 -0.065822 -0.324385

In [45]:
df2.loc['G2']

       col1      col2
1 -0.378350 -1.949282
2  0.409685  0.726959
3 -0.065822 -0.324385

In [46]:
df2.loc['G2'].loc[2]

col1    0.409685
col2    0.726959
Name: 2, dtype: float64

In [48]:
df2.index.names

FrozenList([None, None])

In [50]:
df2.index.names=['index1','index2']
df2

                   col1      col2
index1 index2
G1     1       0.777860 -1.575967
       2       0.247734 -1.876318
       3       0.851627 -0.270488
G2     1      -0.378350 -1.949282
       2       0.409685  0.726959
       3      -0.065822 -0.324385

In [51]:
# xs- cross-section 
df2.xs(['G2',2])

C:\Users\2000139\AppData\Local\Temp\ipykernel_2116\576956410.py:2: FutureWarning: Passing lists as key for xs is deprecated and will be removed in a future version. Pass key as a tuple instead.
  df2.xs(['G2',2])

col1    0.409685
col2    0.726959
Name: (G2, 2), dtype: float64

In [52]:
df.loc['WY']

W    0.150022
X    0.195958
Y    1.151734
Z   -1.502619
Name: WY, dtype: float64

In [53]:
df.iloc[2]

W    0.150022
X    0.195958
Y    1.151734
Z   -1.502619
Name: WY, dtype: float64

In [54]:
#missing data

In [55]:
np.nan

nan

In [57]:
df3=pd.DataFrame({'A':[1,2,np.nan],'B':[10,np.nan,np.nan],'C':[5,5,6]})
df3

     A     B  C
0  1.0  10.0  5
1  2.0   NaN  5
2  NaN   NaN  6

In [58]:
df3.dropna()

     A     B  C
0  1.0  10.0  5

In [61]:
df3.dropna(axis=1)

   C
0  5
1  5
2  6

In [67]:
df3.dropna(thresh=3)

     A     B  C
0  1.0  10.0  5

In [68]:
df3.fillna(value='PUNE')

      A     B  C
0   1.0  10.0  5
1   2.0  PUNE  5
2  PUNE  PUNE  6

In [69]:
df3

     A     B  C
0  1.0  10.0  5
1  2.0   NaN  5
2  NaN   NaN  6

In [70]:
df3.fillna(value=df3.mean())

     A     B  C
0  1.0  10.0  5
1  2.0  10.0  5
2  1.5  10.0  6